package ru.flashcards.telegram.bot.utils;

public final class Help {

    private Help() {
    }

    public static String manual() {
        return "*Основные функции и команды:*\n\n" +
                "1. *Поиск новых карточек:*\n" +
                "   - `/f` - покажет популярные карточки.\n" +
                "   - `/f comfy` - найдет карточку для слова \"comfy\".\n" +
                "   - Кнопки в меню карточки:\n" +
                "     - \"Добавить для изучения\" - сохранит в профиль.\n" +
                "     - \"Знаю\" - исключит из предложенных.\n" +
                "     - \"Выйти\" - завершит режим добавления.\n\n" +

                "2. *Swiper (просмотр карточек):*\n" +
                "   - `/s` - откроет Swiper с вашими карточками.\n" +
                "   - `/s ca` - покажет карточки, начинающиеся на \"ca\".\n" +
                "   - `/s ca 100` - покажет карточки \"ca\", выученные на 100%.\n" +
                "   - Кнопки в меню Swiper-а:\n" +
                "     - \"Учить повторно\" - сброс статистики.\n" +
                "     - \"Повысить приоритет\" - делает карточку приоритетной.\n" +
                "     - \"Примеры использования\" - показывает примеры предложений.\n" +
                "     - \"Удалить\" - убирает из профиля.\n\n" +

                "3. *Упражнения:*\n" +
                "   - `/l` - начать упражнения.\n" +
                "   - `/d` - показать активные упражнения и отключить.\n" +
                "   - `/e` - показать отключенные и включить.\n" +
                "   - Изученные в упражнениях карточки попадают в систему интервальных повторений (смотрите раздел 5.Уведомления).\n\n" +

                "4. *Режим Watering session:*\n" +
                "   - `/w` - повторение изученных карточек.\n\n" +

                "5. *Уведомления:*\n" +
                "   - Интервальные повторения:** после упражнений карточка отправляется на повторение через разные интервалы.\n" +
                "   - Случайные карточки:** добавленные вами для изучения.\n\n" +

                "6. *Тренировка предлогов:*\n" +
                "   `/pr` - тренировка из 10 вопросов по всем темам.\n" +
                "   `/pr verbs` - тренировка по теме, список тем: `/pr topics`.\n" +
                "   `/pv` - тренировка фразовых глаголов: выбрать значение из 4 вариантов.\n\n" +

                "7. *Настройки и доп. функции:*\n" +
                "   - `/ni 120` - установить периодичность уведомлений для случайных карточек (по умолчанию 60 минут).\n" +
                "   - `/fq 10` - установить количество карточек в упражнениях (по умолчанию 5 карточек).\n" +
                "   - `/wt 3` - установить таймер ответа для режима Watering session (по умолчанию 5 секунд).\n" +
                "   - `/ed picturesque` - отредактировать перевод для карточки \"picturesque\".\n" +
                "   - `/rl 20` - показать последние 20 выученных карточек (в одном сообщении).\n" +
                "   - `/h` - отобразить руководство пользователя\n";

    }
}
